// Описание алгоритма решения:

// Сoздаем и объявляем два массива общей длины.
// Далее создается метод,где цикл соответствует длине массива.
// Далее проверка цикла по заданному условию, т.е. <=3, если 
// условие выполняется,то элемент первого массива заносится во 
// второй массив. После присвоения второго массива, увеличиваем 
// переменную N на 1 и возвращаемся к циклу в котором i элементов 
// увеличивается на 1. И так проходим по циклу, пока удовлетворяется условие.
// Когда условия перестали удовлетворятся, делаем вывод на экран результата.


